# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..Height Property
Stairs Class See Also
---
The height of the stair between the base and top levels.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Height { get; set; }
```

Visual Basic
---
```text
Public Property Height As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Height {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for stairsHeight must be greater than 0 and no more than 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The stairs top level is not "None", so the height cannot be set independently. |

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace